{"pages":[{"title":"","text":"感谢您的访问","link":"/about/index.html"},{"title":"","text":"","link":"/categories/index.html"},{"title":"","text":"","link":"/tags/index.html"}],"posts":[{"title":"Association Analysis Basic Concepts and Algorithms","text":"MathJax.Hub.Config({ tex2jax: { skipTags: ['script', 'noscript', 'style', 'textarea', 'pre'], inlineMath: [['$','$']] } }); PreliminariesBinary Representation​ Market basket data can be represented in a binary format where each row corresponds to a transaction and each column corresponds to an item. An item can be treated as a binary variable whose value is one if the item is present in a transaction and zero otherwise. Because the presence of an item in a transaction is often considered more important than its absence, an item is an asymmetric binary variable. Itemset and Support Count Itemset: 项集 Frequent Itemset: 频繁项集 Let $I = {i_1, i_2, \\dots, i_d}$ be the set of all items in a market basket data and $T = {t_1, t_2, \\dots, t_N}$ be the set of all transactions. Each transaction $t_i$ contains a subset of items chosen from $I$. In association analysis, a collection of zero or more items is termed an itemset. If an itemset contains $k$ items, it is called a k-itemset. e.g. {Beer, Diapers, Milk} is am example of a 3-itemset.(3项集). The null(or empty) set is an itemset that does not contain any items. A transaction $t_j$ is said to contain an itemset $X$ if $X$ is a subset of $t_j$. An important property of an itemset is its support count, which refers to the number of transactions that contain a particular itemset. Mathematically, the support count, $\\sigma(X)$, for an itemset $X$ can be stated as follows:$$\\sigma(X) = |{t_i|X \\subseteq t_i,\\ t_i \\in T}|$$Support, which is fraction of transaction in which an itemset occurs:$$s(X) = \\frac{\\sigma(X)}{N}$$where $N$ is the number of transactions. An itemset $X$ is called frequent if $s(X)$ is greater than some user-defined threshold, minsup. Association RuleAn association rule is an implication expression of the form $X\\rightarrow Y$, where $X$ and $Y$ are disjoint itemset,i.e., $X \\cap Y = \\emptyset$. The strength of an association rule can be measured in terms of its support and confidence. Support determines how often a rule is applicable to a given data set. Confidence determines how frequently items in $Y$ appear in transactions that contain $X$, measures the reliability of the inference made by a association rule. confidence also provides an estimate of the conditional probability of $Y$ given $X$.$$Support, \\ s(X\\rightarrow Y) = \\frac{\\sigma(X\\cup Y)}{N};\\Confidence,\\ c(X\\rightarrow Y) = \\frac{\\sigma(X\\cup Y)}{\\sigma(X)}$$","link":"/2023/10/19/Association%20Analysis/"}],"tags":[{"name":"Association Analysis","slug":"Association-Analysis","link":"/tags/Association-Analysis/"},{"name":"data mining theories","slug":"data-mining-theories","link":"/tags/data-mining-theories/"},{"name":"[object Object]","slug":"object-Object","link":"/tags/object-Object/"}],"categories":[]}